OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Mass_Stroage_ScatterGather/MassStorage.c
    USBD_SET_DMA_ADDR(u32Addr);
    USBD_SET_DMA_LEN(8);
    g_usbd_DmaDone = 0;
    USBD->DMACTL |= (USBD_DMACTL_DMAEN_Msk|USBD_DMACTL_SGEN_Msk|USBD_DMACTL_DMARD_Msk);
    while(g_usbd_Configured) {
        if (g_usbd_DmaDone)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}

void MSC_BulkInSG(uint32_t u32Addr)
{
    /* bulk in, dma read, epnum = 1 */
    USBD_SET_DMA_READ(BULK_IN_EP_NUM);
    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(USBD_BUSINTEN_DMADONEIEN_Msk|USBD_BUSINTEN_SUSPENDIEN_Msk|USBD_BUSINTEN_RSTIEN_Msk|USBD_BUSINTEN_VBUSDETIEN_Msk);

    USBD_SET_DMA_ADDR(u32Addr);
    USBD_SET_DMA_LEN(8);    /* scatter-gather descriptor size */
    g_usbd_DmaDone = 0;
    USBD->DMACTL |= (USBD_DMACTL_DMAEN_Msk|USBD_DMACTL_SGEN_Msk);
    while(g_usbd_Configured) {
        if (g_usbd_DmaDone)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}


void MSC_ReceiveCBW(uint32_t u32Buf, uint32_t u32Len)
{

    /* bulk out, dma write, epnum = 2 */
    USBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);

    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(USBD_BUSINTEN_DMADONEIEN_Msk|USBD_BUSINTEN_SUSPENDIEN_Msk|USBD_BUSINTEN_RSTIEN_Msk|USBD_BUSINTEN_VBUSDETIEN_Msk);
    USBD_SET_DMA_ADDR(u32Buf);
    USBD_SET_DMA_LEN(u32Len);

    g_usbd_DmaDone = 0;
    USBD_ENABLE_DMA();

    while(g_usbd_Configured) {
        if (g_usbd_DmaDone == 1)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}

void MSC_ProcessCmd(void)
{
    uint32_t i;
    uint32_t Hcount, Dcount;

    if (g_u8MscOutPacket) {
        g_u8MscOutPacket = 0;

        if (g_u8BulkState == BULK_CBW) {

            /* Check CBW */
            g_u32CbwSize = USBD->EP[EPB].EPDATCNT & 0xffff;
            MSC_ReceiveCBW(g_u32MassBase, g_u32CbwSize);

            /* Check Signature & length of CBW */
            if ((*(uint32_t *)(g_u32MassBase) != CBW_SIGNATURE) || (g_u32CbwSize != 31)) {
                /* Invalid CBW */
                g_u8Prevent = 1;
                USBD_SetEpStall(EPA);
                USBD_SetEpStall(EPB);
                g_u32EpStallLock = (1 << EPA) | (1 << EPB);
                return;
            }

            /* Get the CBW */
            for (i = 0; i < 31; i++)
                *((uint8_t *) (&g_sCBW.dCBWSignature) + i) = *(uint8_t *)(g_u32MassBase + i);

            /* Prepare to echo the tag from CBW to CSW */
            g_sCSW.dCSWTag = g_sCBW.dCBWTag;
            Hcount = g_sCBW.dCBWDataTransferLength;

            /* Parse Op-Code of CBW */
        switch (g_sCBW.u8OPCode) {
            case UFI_READ_12:
            case UFI_READ_10: {
								uint32_t length, scater_length, total_length = g_sCBW.dCBWDataTransferLength;
                Dcount = (get_be32(&g_sCBW.au8Data[4])>>8) * 512;
                if (g_sCBW.bmCBWFlags == 0x80) {    /* IN */
                    if (Hcount == Dcount) { /* Hi == Di (Case 6)*/
                        g_sCSW.bCSWStatus = 0;
                    }
                    else if (Hcount < Dcount) {  /* Hn < Di (Case 2) || Hi < Di (Case 7) */
                        if (Hcount) {   /* Hi < Di (Case 7) */
                            g_u8Prevent = 1;
                            g_sCSW.bCSWStatus = 0x01;
                        }
                        else {  /* Hn < Di (Case 2) */
                            g_u8Prevent = 1;
                            g_sCSW.bCSWStatus = 0x01;
                            g_sCSW.dCSWDataResidue = 0;
                            MSC_AckCmd();
                            return;
                        }
                    }
                    else if (Hcount > Dcount) { /* Hi > Dn (Case 4) || Hi > Di (Case 5) */
                        g_u8Prevent = 1;
                        g_sCSW.bCSWStatus = 0x01;
                    }
                }
                else {  /* Ho <> Di (Case 10) */
                    g_u8Prevent = 1;
                    USBD_SetEpStall(EPB);
                    g_sCSW.bCSWStatus = 0x01;
                    g_sCSW.dCSWDataResidue = Hcount;
                    MSC_AckCmd();
                    return;
                }
                
								/* Get LBA address */
								g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE + g_u32StorageBase;
								while(total_length > 0)
								{
										if(total_length > 16384)
												length = scater_length = 16384;
										else
												length = scater_length = total_length;
										
										i = 0;
										while(scater_length > 0)
										{
												if(scater_length > 2048)
												{
														scater_gather_array[i].COUNT = 0x40000800;
														memcpy((uint8_t *)scater_gather_array[i].ADDRESS, (uint8_t *)g_u32LbaAddress + i * 0x800, 0x800);
														scater_length = scater_length - 0x800;
												}
												else
												{
														scater_gather_array[i].COUNT = 0xC0000000 | scater_length;
														memcpy((uint8_t *)scater_gather_array[i].ADDRESS, (uint8_t *)g_u32LbaAddress + i * 0x800, scater_length);
														scater_length = 0;
												}
												i++;
										}

										MSC_BulkInSG((uint32_t)&scater_gather_array);								
						
										g_u32LbaAddress += length; 
										total_length -= length;
								}
								g_sCSW.dCSWDataResidue = 0;
                break;
            }
            case UFI_WRITE_12:
            case UFI_WRITE_10: {
								uint32_t length, scater_length, total_length = g_sCBW.dCBWDataTransferLength;
								Dcount = (get_be32(&g_sCBW.au8Data[4])>>8) * 512;
                if (g_sCBW.bmCBWFlags == 0x00) {    /* OUT */
                    if (Hcount == Dcount) { /* Ho == Do (Case 12)*/
                        g_sCSW.bCSWStatus = 0;
                    }
                    else if (Hcount < Dcount) { /* Hn < Do (Case 3) || Ho < Do (Case 13) */
                        g_u8Prevent = 1;
                        g_sCSW.bCSWStatus = 0x1;
                        if (Hcount == 0) {  /* Hn < Do (Case 3) */
                            g_sCSW.dCSWDataResidue = 0;
                            MSC_AckCmd();
                            return;
                        }
                    }
                    else if (Hcount > Dcount) { /* Ho > Do (Case 11) */
                        g_u8Prevent = 1;
                        g_sCSW.bCSWStatus = 0x1;
                    }								
										g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE + g_u32StorageBase;
										
										while(total_length > 0)
										{
												if(total_length > 16384)
														length = scater_length = 16384;
												else
														length = scater_length = total_length;
												
												i = 0;
												while(scater_length > 0)
												{
														if(scater_length > 2048)
														{
																scater_gather_array[i].COUNT = 0x00000800;
																scater_length = scater_length - 0x800;
														}
														else
														{
																scater_gather_array[i].COUNT = 0x80000000 | scater_length;
																scater_length = 0;
														}
														i++;
												}

												MSC_BulkOutSG((uint32_t)&scater_gather_array);
												
												scater_length = length;
												
												i = 0;
												while(scater_length > 0)
												{
														if(scater_length > 2048)
														{	
																memcpy((uint8_t *)g_u32LbaAddress + i * 0x800, (uint8_t *)scater_gather_array[i].ADDRESS, 0x800);
																scater_length = scater_length - 0x800;
														}
														else
														{
																memcpy((uint8_t *)g_u32LbaAddress + i * 0x800, (uint8_t *)scater_gather_array[i].ADDRESS, scater_length);
																scater_length = 0;
														}
														i++;
												}	
												g_u32LbaAddress += length; 
												total_length -= length;
										}
                    g_sCSW.dCSWDataResidue = 0;
                }
                else {  /* Hi <> Do (Case 8) */
                    g_u8Prevent = 1;
                    g_sCSW.bCSWStatus = 0x1;
                    USBD_SetEpStall(EPA);
                    g_sCSW.dCSWDataResidue = Hcount;
                    MSC_AckCmd();
                    return;
                }
            break;
        }
        case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL: {
            if (g_sCBW.au8Data[2] & 0x01) {
                g_au8SenseKey[0] = 0x05;  //INVALID COMMAND
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0;
                g_u8Prevent = 1;
            } else
                g_u8Prevent = 0;
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = g_u8Prevent;
            break;
        }
            case UFI_TEST_UNIT_READY: {
                if (Hcount != 0) {
                    if (g_sCBW.bmCBWFlags == 0) {   /* Ho > Dn (Case 9) */
                        g_u8Prevent = 1;
                        USBD_SetEpStall(EPB);
                        g_sCSW.bCSWStatus = 0x1;
                        g_sCSW.dCSWDataResidue = Hcount;
                        MSC_AckCmd();
                    }
                }
                else {  /* Hn == Dn (Case 1) */
                    if (g_u8Remove) {
                        g_sCSW.dCSWDataResidue = 0;
                        g_sCSW.bCSWStatus = 1;
                        g_au8SenseKey[0] = 0x02;    /* Not ready */
                        g_au8SenseKey[1] = 0x3A;
                        g_au8SenseKey[2] = 0;
                        g_u8Prevent = 1;
                    }
                    else {
                        g_sCSW.bCSWStatus = 0;
                        g_sCSW.dCSWDataResidue = 0;
                    }
                    MSC_AckCmd();
                }
                return;
            }
            case UFI_START_STOP: {
                if ((g_sCBW.au8Data[2] & 0x03) == 0x2) {
                    g_u8Remove = 1;
                }
            }
            case UFI_VERIFY_10: {
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_REQUEST_SENSE: {
                if ((Hcount > 0) && (Hcount <= 18)){
                    MSC_RequestSense();
                    g_sCSW.bCSWStatus = 0;
                    g_sCSW.dCSWDataResidue = 0;
                }
                else {
                    USBD_SetEpStall(EPA);
                    g_u8Prevent = 1;
                    g_sCSW.bCSWStatus = 0x01;
                    g_sCSW.dCSWDataResidue = 0;
                }
                break;
            }
            case UFI_READ_FORMAT_CAPACITY: {
                MSC_ReadFormatCapacity();
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_READ_CAPACITY: {
                MSC_ReadCapacity();
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_MODE_SELECT_6:
            case UFI_MODE_SELECT_10: {
                MSC_BulkOut(g_u32StorageBase, g_sCBW.dCBWDataTransferLength);
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_MODE_SENSE_10: {
                MSC_ModeSense10();
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_MODE_SENSE_6: {
                MSC_ModeSense6();
                g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = 0;
                break;
            }
            case UFI_INQUIRY: {
                if ((Hcount > 0) && (Hcount <= 36)){
                    /* Bulk IN buffer */
                    USBD_MemCopy((uint8_t *)(g_u32MassBase), (uint8_t *)g_au8InquiryID, Hcount);
                    MSC_BulkIn(g_u32MassBase, Hcount);
                    g_sCSW.bCSWStatus = 0;
                    g_sCSW.dCSWDataResidue = 0;
                }
                else {
                    USBD_SetEpStall(EPA);
                    g_u8Prevent = 1;
                    g_sCSW.bCSWStatus = 0x01;
                    g_sCSW.dCSWDataResidue = 0;
                }
                break;
            }
						case UFI_READ_16:
						{
										USBD_SetEpStall(EPA);
                    g_u8Prevent = 1;
									g_sCSW.bCSWStatus = 0x01;
                g_sCSW.dCSWDataResidue = 0;
								break;
						}
            default: {
                /* Unsupported command */
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x20;
                g_au8SenseKey[2] = 0x00;

                /* If CBW request for data phase, just return zero packet to end data phase */
                if (g_sCBW.dCBWDataTransferLength > 0)
                    g_sCSW.dCSWDataResidue = Hcount;
                else
                    g_sCSW.dCSWDataResidue = 0;
                g_sCSW.bCSWStatus = g_u8Prevent;
            }
        }
        MSC_AckCmd();
        }
    }

    /* For MSC compliance test, if received an invalid command should stall it */
    while(1) {
        if (USBD->EP[EPA].EPINTSTS & USBD_EPINTSTS_BUFEMPTYIF_Msk) {
            if (g_u32EpStallLock & 0x1)
                USBD_SetEpStall(EPA);
            if (g_u32EpStallLock & 0x2)
                USBD_SetEpStall(EPB);
            break;
        }
        else {
            if ((USBD_GetEpStall(EPA) == 0) && (!(USBD->EP[EPA].EPINTSTS & USBD_EPINTSTS_BUFEMPTYIF_Msk)))
                USBD->EP[EPA].EPRSPCTL = USBD->EP[EPA].EPRSPCTL & 0x10 | USB_EP_RSPCTL_SHORTTXEN;
        }
    }
}

void MSC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(USBD_BUSINTEN_DMADONEIEN_Msk|USBD_BUSINTEN_SUSPENDIEN_Msk|USBD_BUSINTEN_RSTIEN_Msk|USBD_BUSINTEN_VBUSDETIEN_Msk);

    USBD_SET_DMA_ADDR(u32Addr);
    USBD_SET_DMA_LEN(u32Len);
    g_usbd_DmaDone = 0;
    USBD_ENABLE_DMA();
    while(g_usbd_Configured) {
        if (g_usbd_DmaDone)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}

void MSC_AckCmd(void)
{
    USBD_MemCopy((uint8_t *)g_u32MassBase, (uint8_t *)&g_sCSW.dCSWSignature, 13);
    MSC_BulkIn(g_u32MassBase, 13);
    g_u8BulkState = BULK_CBW;
    g_u8MscOutPacket = 0;
}

void MSC_ReadMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
}

void MSC_WriteMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
}

